//底层校验规则

// 率数
export const rateRex = /^0\.[0-9]{1,2}$|^0{1}$|^1{1}$|^1\.[0]{1,2}$/;
// 数字
export const numRex = /-[0-9]+(.[0-9]+)?|[0-9]+(.[0-9]+)?/;
// 金钱（不含0，正数、两位小数）
export const trueNum = /(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/;
// 校验网址(url,支持端口和"?+参数"和"#+参数")
export const urlRex =
	/^(((ht|f)tps?):\/\/)?[\w-]+(\.[\w-]+)+([\w.,@?^=%&:/~+#-]*[\w@?^=%&/~+#-])?$/;
//邮箱
export const regEmail = /^[A-Za-z\d]+([-_.][A-Za-z\d]+)*@([A-Za-z\d]+[-.])+[A-Za-z\d]{2,4}$/;
